<template>
	<footer>
		<div class="container">
			<div class="text-center">
				<div class="dialog">

					<!-- 利用規約ダイアログ -->
					<v-dialog
						v-model="RuleDialog"
						width="500"
					>
						<template v-slot:activator="{ on, attrs }">
							<div class="about"
								v-bind="attrs"
								v-on="on"
							>
								<span>ご利用規約</span>	
							</div>
						</template>

						<v-card>
							<v-card-title class="headline grey lighten-2">
								利用規約
							</v-card-title>
							<v-card-text>
								<br>
								<p>
									この利用規約（以下，「本規約」といいます。）は，このウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を、本サービス作成者（以下、「当方」といいます。）が定めるものです。
									登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。
								</p>
								<h3>第1条（適用）</h3>
								<p>
									本規約は，ユーザーと当方との間の本サービスの利用に関わる一切の関係に適用されるものとします。
									当方は本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。
									これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。
									本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。
								</p>
								<h3>第2条（禁止事項）</h3>
								<p>
									ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。
									<ul>
										<li>法令または公序良俗に違反する行為</li>
										<li>犯罪行為に関連する行為</li>
										<li>本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為</li>
										<li>当方，ほかのユーザー，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為</li>
										<li>本サービスによって得られた情報を商業的に利用する行為</li>
										<li>当方のサービスの運営を妨害するおそれのある行為</li>
										<li>不正アクセスをし，またはこれを試みる行為</li>
										<li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
										<li>不正な目的を持って本サービスを利用する行為</li>
										<li>本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為</li>
										<li>他のユーザーに成りすます行為</li>
										<li>当方が許諾しない本サービス上での宣伝，広告，勧誘，または営業行為</li>
										<li>その他，当方が不適切と判断する行為</li>
									</ul>
								</p>
								<h3>第3条（本サービスの提供の停止等）</h3>
								<p>
									当方は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
									<ul>
										<li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
										<li>地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合</li>
										<li>コンピュータまたは通信回線等が事故により停止した場合</li>
										<li>その他，当方が本サービスの提供が困難と判断した場合</li>
									</ul>
									当方は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。
								</p>
								<h3>第4条（保証の否認および免責事項）</h3>
								<p>
									当方は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。<br>
									当方は，本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし，本サービスに関する当方とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。<br>
									前項ただし書に定める場合であっても，当方は，当方の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（当方またはユーザーが損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。<br>
									当方は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
								</p>
								<h3>第5条（サービス内容の変更等）</h3>
								<p>当方は，ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。</p>
								<h3>第6条（利用規約の変更）</h3>
								<p>当方は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，当該ユーザーは変更後の規約に同意したものとみなします。</p>
								<h3>第7条（個人情報の取扱い）</h3>
								<p>当方は，本サービスの利用によって取得する個人情報については，当方「プライバシーポリシー」に従い適切に取り扱うものとします。</p>
								<h3>第8条（権利義務の譲渡の禁止）</h3>
								<p>ユーザーは，当方の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。</p>
								<h3>第9条（準拠法・裁判管轄）</h3>
								<p>
									本規約の解釈にあたっては，日本法を準拠法とします。
									本サービスに関して紛争が生じた場合には，当方の住所地を管轄する裁判所を専属的合意管轄とします。
								</p>
								<p class="text-right">以上</p>
							</v-card-text>
							<v-divider></v-divider>

							<v-card-actions>
								<v-spacer></v-spacer>
								<v-btn
									text
									@click="RuleDialog = false"
								>
									閉じる
								</v-btn>
							</v-card-actions>
						</v-card>
					</v-dialog>

					<!-- プライバシーポリシーダイアログ -->
					<v-dialog
						v-model="PolicyDialog"
						width="500"
					>
						<template v-slot:activator="{ on, attrs }">
							<div class="about"
								v-bind="attrs"
								v-on="on"
							>
								<span>プライバシーポリシー</span>	
							</div>
						</template>

						<v-card>
							<v-card-title class="headline grey lighten-2">
								プライバシーポリシー
							</v-card-title>
							<v-card-text>
								<br>
								<p>分析導入後、後日記述</p>
								<p class="text-right">以上</p>
							</v-card-text>
							<v-divider></v-divider>

							<v-card-actions>
								<v-spacer></v-spacer>
								<v-btn
									text
									@click="PolicyDialog = false"
								>
									閉じる
								</v-btn>
							</v-card-actions>
						</v-card>
					</v-dialog>
				</div>
			</div>
		</div>
	</footer>
</template>

<script>
export default {
	name: "Footer",
	data() {
		return {
			RuleDialog: false,
			PolicyDialog: false
		}
	}
}
</script>

<style scoped>
footer {
	background-color: rgb(71, 187, 207);
	color: white;
	width: 100%;
}
.about{
	display: inline-block;
	margin: 0 20px;
}
</style>